In [1]:
import pandas as pd

In [4]:
coffee_shop_df = pd.read_csv("coffee_shop_sales.csv", parse_dates=['date'])
coffee_shop_df.head()

,order_id,date,store,product,quantity,sales
0,1,2023-01-01,Lower Manhattan,Gourmet brewed coffee,2,6.0
1,2,2023-01-01,Lower Manhattan,Brewed Chai tea,2,6.2
2,3,2023-01-01,Lower Manhattan,Hot chocolate,2,9.0
3,4,2023-01-01,Lower Manhattan,Drip coffee,1,2.0
4,5,2023-01-01,Lower Manhattan,Brewed Chai tea,2,6.2

In [5]:
coffee_shop_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149116 entries, 0 to 149115
Data columns (total 6 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   order_id  149116 non-null  int64
 1   date      149116 non-null  datetime64[ns]
 2   store     149116 non-null  object
 3   product   149116 non-null  object
 4   quantity  149116 non-null  int64
 5   sales     149116 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 6.8+ MB

In [18]:
summary = coffee_shop_df.groupby(['store', coffee_shop_df['date'].dt.month]).agg(
    sales_total = ('sales', 'sum')
).reset_index()
summary

              store  date  sales_total
0           Astoria     1     27313.66
1           Astoria     2     25105.34
2           Astoria     3     32835.43
3           Astoria     4     39477.61
4           Astoria     5     52428.76
5           Astoria     6     55083.11
6    Hell's Kitchen     1     27820.65
7    Hell's Kitchen     2     25719.80
8    Hell's Kitchen     3     33110.57
9    Hell's Kitchen     4     40304.14
10   Hell's Kitchen     5     52598.93
11   Hell's Kitchen     6     56957.08
12  Lower Manhattan     1     26543.43
13  Lower Manhattan     2     25320.05
14  Lower Manhattan     3     32888.68
15  Lower Manhattan     4     39159.33
16  Lower Manhattan     5     51700.07
17  Lower Manhattan     6     54445.69

In [24]:
prev_month_summary = coffee_shop_df.groupby(['store', coffee_shop_df['date'].dt.month]).agg(
    sales_total = ('sales', 'sum')
).shift(1).reset_index()
prev_month_summary

              store  date  sales_total
0           Astoria     1          NaN
1           Astoria     2     27313.66
2           Astoria     3     25105.34
3           Astoria     4     32835.43
4           Astoria     5     39477.61
5           Astoria     6     52428.76
6    Hell's Kitchen     1     55083.11
7    Hell's Kitchen     2     27820.65
8    Hell's Kitchen     3     25719.80
9    Hell's Kitchen     4     33110.57
10   Hell's Kitchen     5     40304.14
11   Hell's Kitchen     6     52598.93
12  Lower Manhattan     1     56957.08
13  Lower Manhattan     2     26543.43
14  Lower Manhattan     3     25320.05
15  Lower Manhattan     4     32888.68
16  Lower Manhattan     5     39159.33
17  Lower Manhattan     6     51700.07

In [51]:
result = pd.merge(
    prev_month_summary,
    summary,
    on=['store', 'date'],
    suffixes=["_prev", "_curr"]
)
result

              store  date  sales_total_prev  sales_total_curr
0           Astoria     1               NaN          27313.66
1           Astoria     2          27313.66          25105.34
2           Astoria     3          25105.34          32835.43
3           Astoria     4          32835.43          39477.61
4           Astoria     5          39477.61          52428.76
5           Astoria     6          52428.76          55083.11
6    Hell's Kitchen     1          55083.11          27820.65
7    Hell's Kitchen     2          27820.65          25719.80
8    Hell's Kitchen     3          25719.80          33110.57
9    Hell's Kitchen     4          33110.57          40304.14
10   Hell's Kitchen     5          40304.14          52598.93
11   Hell's Kitchen     6          52598.93          56957.08
12  Lower Manhattan     1          56957.08          26543.43
13  Lower Manhattan     2          26543.43          25320.05
14  Lower Manhattan     3          25320.05          32888.68
15  Lower Manhattan     4          32888.68          39159.33
16  Lower Manhattan     5          39159.33          51700.07
17  Lower Manhattan     6          51700.07          54445.69

In [52]:
result['profit'] = result['sales_total_curr'] - result['sales_total_prev']
result.rename(columns=
              {"date" : "month", 
               "sales_total_curr" : "sales", 
               "profit" : "Sales vs last month"}, inplace=True)
result = result.drop("sales_total_prev", axis=1)
result

              store  month     sales  Sales vs last month
0           Astoria      1  27313.66                  NaN
1           Astoria      2  25105.34             -2208.32
2           Astoria      3  32835.43              7730.09
3           Astoria      4  39477.61              6642.18
4           Astoria      5  52428.76             12951.15
5           Astoria      6  55083.11              2654.35
6    Hell's Kitchen      1  27820.65            -27262.46
7    Hell's Kitchen      2  25719.80             -2100.85
8    Hell's Kitchen      3  33110.57              7390.77
9    Hell's Kitchen      4  40304.14              7193.57
10   Hell's Kitchen      5  52598.93             12294.79
11   Hell's Kitchen      6  56957.08              4358.15
12  Lower Manhattan      1  26543.43            -30413.65
13  Lower Manhattan      2  25320.05             -1223.38
14  Lower Manhattan      3  32888.68              7568.63
15  Lower Manhattan      4  39159.33              6270.65
16  Lower Manhattan      5  51700.07             12540.74
17  Lower Manhattan      6  54445.69              2745.62